# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 2  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)
   [-1, 1, ShuffleAttention, [256]], # 修改
   [-1, 1, GatherExcite, [None, False, 0, True, 1./16, None, 1, False, nn.ReLU, nn.BatchNorm2d, 'sigmoid']],  # 19
#   [-1, 1, SE, [16]],


   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 21 (P4/16-medium)  # 22
   [-1, 1, ShuffleAttention, [512]], # 修改
   [-1, 1, GatherExcite, [None, False, 0, True, 1./16, None, 1, False, nn.ReLU, nn.BatchNorm2d, 'sigmoid']],  # 24
#   [-1, 1, SE, [16]],

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 25 (P5/32-large)  # 27
   [-1, 1, ShuffleAttention, [1024]], # 修改
   [-1, 1, GatherExcite, [None, False, 0, True, 1./16, None, 1, False, nn.ReLU, nn.BatchNorm2d, 'sigmoid']],  # 29
#   [-1, 1, SE, [16]],

#   [[18, 22, 25], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
   [[19, 24, 29], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]



# by CSDN 迪菲赫尔曼
# 请勿散播转发，仅供学习交流
#SE:  # https://arxiv.org/abs/1709.01507
#  - [-1, 1, SE, [16]],
#
#CBAM:  # https://openaccess.thecvf.com/content_ECCV_2018/papers/Sanghyun_Woo_Convolutional_Block_Attention_ECCV_2018_paper.pdf
#  - [-1, 1, CBAM, [16, 7]],
#
#BAM:  # https://arxiv.org/pdf/1807.06514.pdf
#  # [-1, 1, BAMBlock, [16, 1]], bug
#
#ECA:  # https://arxiv.org/pdf/1910.03151.pdf
#  - [-1, 1, ECA, [3]],
#
#SimAM:  # http://proceedings.mlr.press/v139/yang21o/yang21o.pdf
#  - [-1, 1, SimAM, [1e-4]],
#
#SKAttention:  # https://arxiv.org/pdf/1903.06586.pdf
#  - [-1, 1, SKAttention, [[1, 3, 5, 7], 16, 1, 32]],
#
#ShuffleAttention:  # https://arxiv.org/pdf/2102.00240.pdf
#  - [-1, 1, ShuffleAttention, [8]],
#
#DoubleAttention:  # https://arxiv.org/pdf/1810.11579.pdf
#  - [-1, 1, DoubleAttention, [128, 128,True]],
#
#CoTAttention:  # https://arxiv.org/abs/2107.12292
#  - [-1, 1, CoTAttention, [3]],
#
#EffectiveSE:   # https://arxiv.org/abs/1911.06667
#  - [-1, 1, EffectiveSEModule, [False,'hard_sigmoid']],
#
#GlobalContext:  # https://arxiv.org/abs/1904.11492
#  - [-1, 1, GlobalContext, [True, False, True, False, 1./8, None, 1, nn.ReLU, 'sigmoid']],
#
#GatherExcite:  # https://arxiv.org/abs/1911.06667
#  - [-1, 1, GatherExcite, [None, False, 0, True, 1./16, None, 1, False, nn.ReLU, nn.BatchNorm2d, 'sigmoid']],
#
#MHSA:    # https://arxiv.org/abs/2107.00782
#  - [-1, 1, MHSA, [14, 14 ,4 , False]],
#
#ParNetAttention:  # https://arxiv.org/abs/2110.07641
#  - [-1, 1, ParNetAttention, []],
#
#TripletAttention:   # https://arxiv.org/abs/2108.01072
#  - [-1, 1, TripletAttention, [False]],
#
#SpatialGroupEnhance:  # https://arxiv.org/pdf/1905.09646.pdf
#  - [-1, 1, SpatialGroupEnhance, [8]],
#
#
## -----------ↆ channels = upper layer channels--------------------------#
#NAMAttention:   # https://arxiv.org/abs/2111.12419                       #
#  - [-1, 1, NAMAttention, [1024]],                                       #
#                                                                         #
#S2Attention:  # https://arxiv.org/abs/2108.01072                         #
#  - [-1, 1, S2Attention, [1024]],                                        #
#                                                                         #
#CrissCrossAttention:  # https://arxiv.org/abs/1811.11721                 #
#  - [-1, 1, CrissCrossAttention, [1024]],                                #
#                                                                         #
#CA:   # https://arxiv.org/abs/2110.07641                                 #
#  - [-1, 1, CoordAtt, [1024,32]],                                        #
#                                                                         #
#GAMAttention:   # https://arxiv.org/pdf/2112.05561v1.pdf                 #
#  - [-1, 1, GAMAttention, [1024, True, 4]],                              #
#                                                                         #
#PolarizedSelfAttention:  # https://arxiv.org/abs/2107.00782              #
#  - [-1, 1, ParallelPolarizedSelfAttention, [1024]],                     #
#                                                                         #
#SequentialPolarizedSelfAttention:  # https://arxiv.org/abs/2107.00782    #
#  - [-1, 1, SequentialPolarizedSelfAttention, [1024]],                   #
## -----------↑ channels = upper layer channels---------------------------#







